# 5) Даны два файла, в каждом из которых находится запись многочлена. Задача - сформировать файл, содержащий сумму многочленов.
НЕ УСПЕЛ

# with open('file.txt', 'r') as data:
#     st1 = data.readlines()
# with open('file.txt', 'r') as data:
#     st2 = data.readlines()
# print(f"Первый многочлен {st1}")
# print(f"Второй многочлен {st2}")

# ll = len(st1)
# if len(st1) > len(st2):
#     ll = len(st2)
# lst_new = [st1[i] + st2[i] for i in range(ll)]
# if len(st1) > len(st2):
#     mm = len(st1)
#     for i in range(ll,mm):
#         lst_new.append(st1[i])
# else:
#     mm = len(st2)
#     for i in range(ll,mm):
#         lst_new.append(st2[i])
# data = open('file2.txt', 'a')
# data.writelines(f'{lst_new}\n')
# data.close()

# print(f"Результирующий многочлен {st2}")